#+TITLE： 硕士毕业论文日志
#+AUTHOR： 王勇
#+EMAIIL: yungwong.seu@gmail.com
#+STARTUP: indent

* 小论文：龙卷风作用下大跨越输电塔结构的静态响应分析
** 结果分析
*** DONE 准备 0 度、45 度和 90 度分析工况；
单向流固耦合分析工况中，选择 30 度结果代替 0 度，选择 75 度结果代替 90 度。

*** DONE 选取关键构件单元编号
CLOSED: [2017-03-27 Mon 19:04]
利用 ANSYS Meshing 和 Named Selection 提取单元编号。
单元根据梁、柱、支撑和位置（base, mid, arm, etc.)分类，并选取 X 向和 Y 向。
提取的单元较多，故需要在每个典型位置选取一个单元作为代表。

*** DONE 后处理提取关键单元轴向内力
CLOSED: [2017-03-27 Mon 19:05]
利用*GET 命令提取各单元的轴向力。
#+BEGIN_SRC apdl
*GET,Par,ELEM,N,SMISC,Snum
#+END_SRC
编制 APDL 后处理程序，将选取单元的轴向压力写入 CSV 格式的文件。

选取的单元编号需要满足如下条件：
- 采用 FSI 和 CODE 方法计算的结果差别较小；
- 存在 45 度为危险工况的单元；
- 选取单元分别处于不同的位置和方向。

*** 绘制表格

* 大论文
** todo
*** DONE 摘要；论文主要工作；本章引言、小结
CLOSED: [2017-03-27 Mon 15:27]
章节引言主要是介绍目前的研究现状，可引用参考论文中的文章主要工作。

*** TODO 改写 _本课题主要研究内容_ 根据[[吕老师建议]]
*** TODO _总结与展望_
*** TODO _ABSTRACT_ 摘要翻译
*** TODO _绪论课题研究背景及意义_ 增加龙卷风介绍
*** DONE _计算流体动力学基本理论_ 增加湍流模型
CLOSED: [2017-04-05 Wed 10:05]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 09:55]--[2017-04-05 Wed 10:05] =>  0:10
:END:
介绍的是 k-\epsilon 模型，实际使用的是 k-\omega 模型。
需要补充 k-\omega 模型的介绍吗？

*** DONE _龙卷风数值模拟结果及其正确性验证_
CLOSED: [2017-04-05 Wed 15:57]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 10:31]--[2017-04-05 Wed 10:56] =>  0:25
:END:
切向速度云图、切向速度径向变化图、风压云图 etc 增加与 Rankine 涡模型的对比 
重新绘制切向速度在轴向剖面、水平剖面的云图。
切向速度径向变化图增加与 Rankine 涡的对比。
重新绘制风压在轴向剖面、水平剖面的云图。

*** DONE 单向流固耦合方法介绍 
CLOSED: [2017-04-06 Thu 09:25]
参考论文中的介绍。
参考原来报告中单向流固耦合的介绍，略显简单（平时多写报告是很有用的）。

*** DONE _FSI 方法与规范方法的对比_ 增加结果分析
CLOSED: [2017-04-05 Wed 17:00]
增加了与小论文相同的结果分析，但看起来仍然较少。

*** DONE _输电塔结构动力时程分析_ 增加结果分析
CLOSED: [2017-04-06 Thu 15:58]
插图中文字过大，尝试将图片尺寸设为默认。
默认尺寸中图形中文字仍然偏大，思考如何能控制图片中文字的大小。
参考龙卷风动态作用的论文。
=考虑龙卷风动态效应需要叠加风场移动速度吗？=

*** TODO _致谢_
*** TODO _作者简介_ 
*** DONE 插入附录程序
CLOSED: [2017-04-06 Thu 15:57]
AucTeX 配合 minted 宏包和-shell-escape 编译选项插入程序代码。

*** TODO 增加文献引用
主要在引言部分增加参考文献引用。

** 吕老师建议
:LOGBOOK:
CLOCK: [2017-03-27 Mon 21:40]--[2017-04-05 Wed 09:54] => 204:14
:END:
*** 本课题主要研究内容！
- 指出目前研究的不足之处，存在的主要问题。
- 针对目前研究的某个具体的不足之处，总结自己解决了什么问题，采取了什么技术路线（按重要程度排序，不一定按照实际的章节顺序）。
- 介绍 XX 理论 -> 应用 XX 理论解决 XX 问题。
  
